hurrican/wbci-acceptance-test/src/citrus/resources/de/mnet/wbci/acceptance/donating/cdm/v1/VaKueMrnAbg_07/VA_KUEMRN_ABG.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <v1:requestCarrierChange xmlns:v1="http://www.mnet.de/esb/cdm/SupplierPartner/CarrierNegotiationService/v1">
            <v1:VA-KUE-MRN>
                <v1:absender>
                    <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                </v1:absender>
                <v1:empfaenger>
                    <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                </v1:empfaenger>
                <v1:version>2</v1:version>
                <v1:endkundenvertragspartner>
                    <v1:EKPauf>
                        <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                    </v1:EKPauf>
                    <v1:EKPabg>
                        <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                    </v1:EKPabg>
                </v1:endkundenvertragspartner>
                <v1:vorabstimmungsId>${preAgreementId}</v1:vorabstimmungsId>
                <v1:kundenwunschtermin>${requestedCustomerDate}</v1:kundenwunschtermin>
                <v1:endkunde>
                    <v1:person>
                        <v1:anrede>1</v1:anrede>
                        <v1:vorname>Beer</v1:vorname>
                        <v1:nachname>Alexander</v1:nachname>
                    </v1:person>
                </v1:endkunde>
                <v1:projektId>
                    <v1:projektkenner>${wbciSimulatorUseCase}</v1:projektkenner>
                </v1:projektId>
                <v1:standort>
                    <v1:strasse>
                        <v1:strassenname>Martinistr.</v1:strassenname>
                        <v1:hausnummer>43</v1:hausnummer>
                    </v1:strasse>
                    <v1:postleitzahl>86179</v1:postleitzahl>
                    <v1:ort>Augsburg</v1:ort>
                </v1:standort>
                <v1:rufnummernPortierung>
                    <v1:einzelanschluss>
                        <v1:rufnummernliste>
                            <v1:zuPortierendeOnkzRnr>
                                <v1:ONKZ>821</v1:ONKZ>
                                <v1:rufnummer>888877</v1:rufnummer>
                            </v1:zuPortierendeOnkzRnr>
                            <v1:zuPortierendeOnkzRnr>
                                <v1:ONKZ>999</v1:ONKZ>
                                <v1:rufnummer>888878</v1:rufnummer>
                            </v1:zuPortierendeOnkzRnr>
                        </v1:rufnummernliste>
                    </v1:einzelanschluss>
                    <v1:portierungszeitfenster>ZF2</v1:portierungszeitfenster>
                </v1:rufnummernPortierung>
            </v1:VA-KUE-MRN>
        </v1:requestCarrierChange>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
